import React from 'react';
import { Helmet } from 'react-helmet';
import '../Detail.css';
import Nav from '../components/Nav';
import Footer from '../components/Footer';
import Twitter from '../assets/yellowedm.png'
import Facebook from '../assets/facebook.png'
import Line from '../assets/pinkyellowline.jpg'
import Share from '../assets/share.png'
import News3img1 from '../assets/news3img1.png'
import News3img2 from '../assets/news3img2.png'
import News3img3 from '../assets/news3img3.png'
import News4img1 from '../assets/news4img1.png'
import News5img1 from '../assets/news5img1.png'
import News5img2 from '../assets/news5img2.png'
import newsData from '../news';
import { useParams } from 'react-router-dom';

function Detail() {
    const { id } = useParams();

    const selectedNews = newsData.find(news => news.id === parseInt(id));

    return (
        <>
            <Helmet>
                <title>ข่าวสารและกิจกรรม</title>
            </Helmet>
            <Nav />
            <div className="container page-content">
                {selectedNews && (
                    <div className="main">
                        <div className="content">
                            <div className="head">
                                <h1>ข่าวสารและกิจกรรม</h1>
                            </div>
                            <div className="sub-content" style={{
                                marginTop: '40px',
                                marginBottom: '40px',
                                background: '#ffffff',
                                boxShadow: '0px 2px 7px rgba(0, 0, 0, 0.12)',
                                borderRadius: '8px'
                            }}>
                                <div id="news-list" className="news-list">
                                    <div className="div-image">
                                        <img src={selectedNews.image} alt="News Image" />
                                    </div>
                                    <div className="share-wrap">
                                        <div className="left"></div>
                                        <div className="right">
                                            <div className="label">
                                                <img src={Share} alt="ebm รถไฟฟ้ามหานคร สายสีเหลือง" />
                                                <span>แชร์ : </span>
                                            </div>
                                            <div className="group">
                                                <button id="share-btn-item" data-type="fb">
                                                    <img src={Facebook} alt="รถไฟฟ้ามหานคร สายสีเหลือง แชร์แผนที่" />
                                                </button>
                                                <button id="share-btn-item" data-type="twitter">
                                                    <img src={Twitter} alt="รถไฟฟ้ามหานคร สายสีเหลือง แชร์แผนที่" />
                                                </button>
                                                <button id="share-btn-item" data-type="line">
                                                    <img src={Line} alt="รถไฟฟ้ามหานคร สายสีเหลือง แชร์แผนที่" />
                                                </button>
                                            </div>
                                        </div>
                                    </div>
                                    <div className="div-content">
                                        <p>{selectedNews.date}</p>
                                        <h3>{selectedNews.description}</h3>
                                    </div>
                                    {selectedNews.id === 2 ? (
                                        <div className="div-details">
                                            <div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; บริษัท อีสเทิร์น บางกอกโมโนเรล จำกัด (EBM) ผู้รับสัมปทาน รถไฟฟ้ามหานคร สายสีเหลือง ยกขบวนโปรโมท&nbsp;
                                                <b>โปรโมชันสุดคุ้ม “ นั่งไปไหนก็ 25 บาท ตลอดสาย”</b>
                                                &nbsp;กับแพ็กเกจเที่ยวเดินทางรายสัปดาห์ 7 วัน 10 เที่ยว 250 บาท*&nbsp;<b>พร้อมจัดกิจกรรมเดิน Troop มอบความสดชื่นแจกน้ำเก๊กฮวยให้กับประชาชน ในแหล่งชุมชนใกล้สถานีรถไฟฟ้ามหานคร สายสีเหลือง ตลอดสาย ลาดพร้าว - สำโรง</b>&nbsp;อาทิ ตลาด, ห้างสรรพสินค้า และโรงเรียน ในวันที่ 12 – 13, 17 - 18 กุมภาพันธ์ และ 1 - 2 มีนาคม 2567&nbsp;
                                            </div>
                                            <div>
                                                <br />
                                            </div>
                                            <div style={{ textAlign: 'center' }}>
                                                <img src="https://ebm.co.th/img/news/13Feb2024/P1.jpg" style={{ width: '245px', borderRadius: '0px' }} alt="Image 1" />&nbsp;&nbsp;&nbsp;&nbsp;
                                                <img src="https://ebm.co.th/img/news/13Feb2024/P2.jpg" style={{ width: '245px', borderRadius: '0px' }} alt="Image 2" />&nbsp;&nbsp;&nbsp;&nbsp;
                                                <img src="https://ebm.co.th/img/news/13Feb2024/P3.jpg" style={{ width: '245px', borderRadius: '0px' }} alt="Image 3" />
                                            </div>
                                            <div style={{ textAlign: 'center' }}>
                                                <br />
                                            </div>
                                            <div style={{ textAlign: 'center' }}>
                                                <img src="https://ebm.co.th/img/news/13Feb2024/P4.jpg" style={{ width: '245px', borderRadius: '0px' }} alt="Image 4" />&nbsp;&nbsp;&nbsp;&nbsp;
                                                <img src="https://ebm.co.th/img/news/13Feb2024/P5.jpg" style={{ width: '245px', borderRadius: '0px' }} alt="Image 5" />&nbsp;&nbsp;&nbsp;&nbsp;
                                                <img src="https://ebm.co.th/img/news/13Feb2024/P6.jpg" style={{ width: '245px', borderRadius: '0px' }} alt="Image 6" />
                                            </div>
                                            <div style={{ textAlign: 'center' }}>
                                                <br />
                                            </div>
                                            <div>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
                                                <b>พิเศษ! สุดสำหรับกิจกรรมนี้&nbsp;</b>
                                                เพียงดาวน์โหลดแอปพลิเคชันแรบบิท รีวอร์ดส และโชว์หน้าแอปพลิเคชันในกิจกรรมวันที่ 17 - 18 กุมภาพันธ์ และ 2 มีนาคม 2567 จะได้รับ 250 แรบบิท พอยท์ ไว้แลกสิทธิพิเศษ ส่วนลดต่าง ๆ ในช่องทางแอปพลิเคชัน
                                            </div>
                                            <div>
                                                <br />
                                            </div>
                                            <div style={{ textAlign: 'center' }}>
                                                <img src="https://ebm.co.th/img/news/13Feb2024/P7.jpg" style={{ width: '500px', float: 'none', borderRadius: '0px' }} alt="Image 7" />
                                                <br />
                                            </div>
                                            <div>
                                                <br />
                                            </div>
                                            <div>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ผู้โดยสาร และประชาชนที่สนใจกิจกรรมดี ๆ ในการมอบความสดชื่น ตลอดแนวเส้นทางรถไฟฟ้ามหานคร สายสีเหลือง&nbsp;
                                                <b>สามารถติดตามรายละเอียดกิจกรรมได้ที่ Facebook Page : MRTYellowLine</b>
                                            </div>
                                            <div>
                                                <b>
                                                    <br />
                                                </b>
                                            </div>
                                        </div>
                                    ) : selectedNews.id === 3 ? (
                                        <div className="div-details">
                                            <h2><b>รถไฟฟ้ามหานคร สายสีเหลือง เปิดตัวโปรใหม่ เหมาจ่ายค่าโดยสารรายสัปดาห์ เพียง 25 บาทต่อเที่ยว*</b></h2>
                                            <h2><b>ตลอดสาย เริ่ม 1 ก.พ.นี้</b></h2>
                                            <h2><b><br /></b></h2>
                                            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;บริษัท อีสเทิร์น บางกอกโมโนเรล จำกัด (EBM) ผู้รับสัมปทาน รถไฟฟ้ามหานคร สายสีเหลือง เปิดตัวโปรโมชันแพ็กเกจเที่ยวเดินทางเหมาจ่ายรายสัปดาห์ “<b>โปรใหม่! แบบสัป(ดาห์) นั่งไปไหนก็ 25 บาท</b>” เริ่มจำหน่ายตั้งแต่วันที่ 1 กุมภาพันธ์ 2567 – 30 เมษายน 2567</p>
                                            <p><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
                                                <b>&nbsp;แพ็กเกจนี้ สำหรับผู้ถือบัตรแรบบิท บุคคลทั่วไป และนักเรียน นักศึกษาเท่านั้น</b>
                                                ผู้โดยสารที่ซื้อแพ็กเกจ จะได้รับเที่ยวเดินทางจำนวน 10 เที่ยว และมีระยะเวลาในการใช้งาน 7 วัน ในราคา 250 บาท (25 บาท ต่อเที่ยว) และสามารถใช้เดินทางรถไฟฟ้ามหานคร สายสีเหลืองได้ทั้ง 23 สถานี ตั้งแต่สถานีลาดพร้าว - สถานีสำโรง โดยสามารถซื้อแพ็กเกจได้ 2 ช่องทาง คือ ห้องจำหน่ายบัตรโดยสารรถไฟฟ้ามหานคร สายสีเหลือง ทุกสถานี และแอปพลิเคชันแรบบิท รีวอร์ดส</p>
                                            <p><br />&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
                                                <b>พิเศษ! สำหรับผู้ซื้อแพ็กเกจผ่านแอปพลิเคชันแรบบิท รีวอร์ดส จะได้รับคูปองส่วนลดพิเศษมากมายจากร้านค้าที่เข้าร่วมรายการ</b>
                                                และสำหรับผู้ที่ถือบัตรแรบบิทที่ผูกบัญชีกับไลน์ เพย์ สามารถซื้อแพ็กเกจผ่านแอปพลิเคชันแรบบิท รีวอร์ดส ได้ช่องทางเดียวเท่านั้น</p>
                                            <p><br />&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; สามารถสอบถามรายละเอียดเพิ่มเติมได้ที่ ศูนย์ลูกค้าสัมพันธ์รถไฟฟ้ามหานคร สายสีเหลือง MRT Yellow Line Call Center โทรศัพท์ 0 2 - 617- 6111 Line Official : @pinkyellowline เว็บไซต์ www.ebm.co.th หรือ Facebook Page : MRTYellowLine หรือเช็กสถานะการเดินรถได้ที่ Application ‘The SKYTRAINs’</p>
                                            <br />
                                            <p style={{ fontSize: '12px' }}>*เงื่อนไข
                                                <br />&nbsp; &nbsp; - โปรโมชันแพ็กเกจเที่ยวเดินทางรถไฟฟ้ามหานคร สายสีเหลือง 10 เที่ยว / 7 วัน ราคา 250 บาท (ราคา 25 บาท ต่อเที่ยว)
                                                <br />&nbsp; &nbsp; - ใช้เดินทางในเส้นทางรถไฟฟ้ามหานคร สายสีเหลือง 23 สถานี (สถานีลาดพร้าว ถึงสถานีสำโรง) เท่านั้น
                                                <br />&nbsp; &nbsp; - ราคาแพ็กเกจไม่รวมค่าธรรมเนียมในกรณีการออกบัตรแรบบิทใหม่ - โปรโมชันจำหน่ายตั้งแต่วันที่ 1 กุมภาพันธ์ 2567 - 30 เมษายน 2567
                                                <br />&nbsp; &nbsp; - โปรโมชันสำหรับบัตรแรบบิท บุคคลทั่วไป และนักเรียน นักศึกษาเท่านั้น - สำหรับบัตรแรบบิทที่ผูกไลน์ เพย์สามารถซื้อแพ็กเกจผ่านแอปพลิเคชันแรบบิท รีวอร์ดส ได้ช่องทางเดียวเท่านั้น
                                                <br />&nbsp; &nbsp; - ผู้โดยสารจะต้องใช้เที่ยวเดินทางแรกจากแพ็กเกจภายใน 30 วันนับตั้งแต่วันที่ซื้อแพ็กเกจ และเที่ยวเดินทางที่เหลือจะมีอายุการใช้งาน 7 วัน นับตั้งแต่วันที่มีการใช้เที่ยวเดินทางครั้งแรก (เที่ยวเดินทางที่ไม่ได้ใช้ภายในระยะเวลาที่กำหนดจะหมดอายุโดยอัตโนมัติ)
                                                <br />&nbsp; &nbsp; - เที่ยวเดินทางไม่สามารถขาย แลกเปลี่ยน โอน หรือถอนเป็นเงินสดได้ และไม่สามารถใช้ร่วมกับส่วนลดหรือโปรโมชันอื่น ๆ ได้
                                                <br />&nbsp; &nbsp; &nbsp;- เงื่อนไขเป็นไปตามที่บริษัทฯ กำหนด ทั้งนี้ บริษัทฯ ขอสงวนสิทธิ์ในการแก้ไขหรือเปลี่ยนแปลงข้อกำหนด และ/หรือเงื่อนไขต่าง ๆ นี้ รวมทั้งปฏิเสธการให้บริการกรณีผู้โดยสารไม่ปฏิบัติตามข้อกำหนด และ/หรือเงื่อนไขดังกล่าว
                                            </p>
                                            <p></p>
                                            <p></p>
                                        </div>
                                    ) : selectedNews.id === 4 ? (
                                        <div class="div-details">
                                            <p style={{ textAlign: 'justify', margin: '0cm 0cm 0.0001pt', textIndent: '36pt' }}>
                                                <span lang="TH">
                                                    วันที่ 22 สิงหาคม 2566 ณ ห้องสุรศักดิ์ 1 โรงแรมอีสติน แกรนด์ สาทร พล.ต.ต.วราห์ เอี่ยมมงคล&nbsp;
                                                    กรรมการที่ปรึกษา บริษัทระบบขนส่งมวลชนกรุงเทพ จำกัด (มหาชน) ในฐานะตัวแทนบริษัท อีสเทิร์น บางกอกโมโนเรล จำกัด (EBM) 
                                                    ผู้ให้บริการรถไฟฟ้ามหานคร สายสีเหลือง และประธานในพิธี พร้อมด้วย นายณัฐชัย ผะเดิมชิต ผู้อำนวยการฝ่ายความปลอดภัย 
                                                    และรักษาความปลอดภัย และตัวแทนหน่วยงานภาครัฐ และเอกชน ที่เกี่ยวข้องได้แก่ ร.ต.อ. ศิรวัชร์ แก้วดุสิต 
                                                    ผู้อำนวยการฝ่ายรักษาความปลอดภัย และกู้ภัย การรถไฟฟ้าขนส่งมวลชนแห่งประเทศไทยนายยุทธนา เศรษฐนันท์ 
                                                    ผู้อำนวยการศูนย์บริการการแพทย์ฉุกเฉินกรุงเทพมหานคร (ศูนย์เอราวัณ) สำนักการแพทย์ นายศิริชัย นิ่มมา 
                                                    ผู้อำนวยการสำนักบริหารจัดการระบบการแพทย์ฉุกเฉิน พื้นที่ 3 และนายภุชพงศ์ สัญญโชติ หัวหน้าสถานีดับเพลิง และกู้ภัยลาดยาว 
                                                    กองปฏิบัติการดับเพลิง และกู้ภัย 3 สำนักป้องกัน และบรรเทาสาธารณภัย ร่วมกันเปิดสัมมนา “โครงการสร้างความเข้าใจรถไฟฟ้ามหานคร 
                                                    สายสีเหลือง และการบริหารจัดการเหตุฉุกเฉิน” ซึ่งภายในงานได้มีการบรรยายพิเศษเรื่อง “ระบบบัญชาการเหตุฉุกเฉิน (ICS) 
                                                    เพื่อการจัดการเหตุฉุกเฉิน” และการเสวนาหัวข้อ “การบริหารจัดการเชิงบูรณาการร่วมสถานการณ์ฉุกเฉิน”
                                                </span>
                                            </p>
                                            <br />
                                            <div style={{ textAlign: 'center' }}>
                                                <img src={News3img1} style={{ width: '100%', borderRadius: '0px' }} alt="Image 1" />
                                            </div>
                                            <br />
                                            <p style={{ textAlign: 'justify', margin: '0cm 0cm 0.0001pt', textIndent: '36pt' }}>
                                                <span lang="TH">
                                                    สำหรับเป้าหมายการจัดสัมมนาในครั้งนี้ เพื่อต้องการสร้างความเข้าใจเกี่ยวกับระบบรถไฟฟ้ามหานครสายสีเหลือง การบริหารจัดการเหตุฉุกเฉินในภาพรวม 
                                                    และการประสานงานขอความช่วยเหลือจากเจ้าหน้าที่หน่วยบริการเหตุการณ์ฉุกเฉินภายนอก ทั้งในส่วนของเจ้าหน้าที่ตำรวจ 
                                                    เจ้าหน้าที่สำนักป้องกันและบรรเทาสาธารณภัย เจ้าหน้าที่หน่วยบริการการแพทย์ฉุกเฉิน รวมถึงหน่วยงานองค์กรปกครองท้องถิ่น 
                                                    เพื่อให้สามารถประสานการทำงานร่วมกันและตอบสนองต่อเหตุการณ์ฉุกเฉินที่อาจเกิดขึ้นได้อย่างรวดเร็ว
                                                </span>
                                            </p>
                                            <br />
                                            <div style={{ textAlign: 'center' }}>
                                                <img src={News3img2} style={{ width: '100%', borderRadius: '0px' }} alt="Image 2" />
                                            </div>
                                            <br />
                                            <p style={{ textAlign: 'justify', margin: '0cm 0cm 0.0001pt', textIndent: '36pt' }}>
                                                <span lang="TH">
                                                พล.ต.ต.วราห์  กล่าวว่า การจัดสัมมนาในครั้งนี้ เพื่อให้ทุกหน่วยงานที่เกี่ยวข้องกับโครงการ มีความเข้าใจในระบบรถไฟฟ้ามหานคร 
                                                สายสีเหลืองในภาพรวม เช่น เส้นทางการให้บริการ และส่วนประกอบของสถานี อาทิ ระบบจ่ายกระแสไฟฟ้า โครงสร้างสถานี และอุปกรณ์ รวมถึงความเข้าใจ 
                                                การบริหารจัดการเหตุการณ์ฉุกเฉินของบริษัทฯ เพื่อทำให้เกิดความคุ้นเคยในการประสานงานความร่วมมือในการดำเนินงาน ด้านความปลอดภัย 
                                                และยังเป็นการสานความสัมพันธ์อันดี ระหว่างเจ้าหน้าที่ในแต่ละหน่วยงาน
                                                </span>
                                            </p>
                                            <p style={{ textAlign: 'justify', margin: '0cm 0cm 0.0001pt', textIndent: '36pt' }}>
                                                <span lang="TH">
                                                พร้อมเชื่อว่าหลังจากการเสวนาร่วมกันในครั้งนี้ แต่ละหน่วยงานจะเข้าใจถึงข้อปฏิบัติ และบทบาทหน้าที่ของหน่วยงานมากยิ่งขึ้น 
                                                ซึ่งระบบการปฏิบัติการแก้ไขเหตุการณ์ฉุกเฉินที่มีความรวดเร็ว คล่องตัว และมีมาตรฐานจะช่วยลดผลกระทบที่เกิดขึ้นกับประชาชน 
                                                และพื้นที่โดยรอบได้เป็นอย่างดี
                                                </span>
                                            </p>
                                            <br />
                                            <div style={{ textAlign: 'center' }}>
                                                <img src={News3img3} style={{ width: '100%', borderRadius: '0px' }} alt="Image 3" />
                                            </div>
                                        </div>
                                    ) : selectedNews.id === 5 ? (
                                        <div className="div-details">
                                            <p style={{ boxSizing: 'border-box', textAlign: 'justify' }}>
                                                &nbsp; &nbsp; &nbsp; &nbsp;<b>&nbsp;</b><span>นายราชิต รักษาสัตย์ ผู้อำนวยการฝ่ายซ่อมบำรุง และนายธวัชชัย พานิชยากรณ์
                                                    ผู้อำนวยการฝ่ายปฏิบัติการรถไฟฟ้ามหานคร สายสีชมพู และ สายสีเหลือง ในฐานะตัวแทนบริษัท อีสเทิร์น บางกอกโมโนเรล จำกัด (EBM)
                                                    พร้อมฝ่ายบริหาร และเจ้าหน้าที่รถไฟฟ้า ร่วมกันจัดกิจกรรม&nbsp;“Yellow Line ส่งความสุข...ทุกโรงเรียน” ครั้งที่ 3
                                                    เพื่อให้ความรู้ในการใช้ระบบรถไฟฟ้ามหานคร สายสีเหลืองอย่างถูกต้อง และปลอดภัย ให้กับน้อง ๆ นักเรียนโรงเรียน
                                                    หัวหมากวิทยานุสรณ์ ใกล้บริเวณสถานีแยกลำสาลี (YL09) โดยมี นายสมหมาย มะลิซ้อน ผู้อำนวยการและนายสมเกียรติ มะลิซ้อน
                                                    รองผู้อำนวยการ โรงเรียน หัวหมากวิทยานุสรณ์ ร่วมให้การต้อนรับ</span>
                                            </p>
                                            <p style={{ textAlign: 'justify' }}><span><br /></span></p>
                                            <div style={{ textAlign: 'center' }}>
                                                <img src={News4img1} style={{ width: '100%', borderRadius: '0px' }} alt="Image 1" />
                                            </div>
                                            <span style={{ letterSpacing: '-0.015em' }}>
                                                <br />&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;
                                                <div style={{ textAlign: 'justify' }}>
                                                    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span lang="TH">สำหรับการจัดกิจกรรมในวันนี้เป็นการให้ความรู้ เรื่องความปลอดภัย ระเบียบ ข้อปฏิบัติ การใช้ระบบรถไฟฟ้าอย่างถูกต้อง ผ่านวิดีโอ เสริมทักษะความรู้ โครงการรถไฟฟ้ามหานคร สายสีเหลือง และจัดกิจกรรมตอบคำถามส่งเสริมความรู้ เกี่ยวกับ</span>
                                                    <span>ภาวะโลกร้อน ในหัวข้อ&nbsp;
                                                        "เรามาโรงเรียนอย่างไร?"&nbsp;เพื่อให้น้อง ๆ นักเรียนได้ตระหนักถึงอัตราการปล่อยก๊าซคาร์บอนไดออกไซด์ของพาหนะแต่ละชนิด&nbsp;
                                                        พร้อมแจกของรางวัลให้กับกลุ่มนักเรียน นอกจากนี้ได้พากลุ่มนักเรียนชั้นประถมศึกษาปีที่&nbsp;4, 5,&nbsp;และ&nbsp;
                                                        6&nbsp;จำนวน&nbsp;110&nbsp;คน ทดลองใช้บริการรถไฟฟ้ามหานคร สายสีเหลืองจากสถานีแยกลำสาลี&nbsp;(YL09)&nbsp;ถึง
                                                        สถานีศรีเอี่ยม&nbsp;(YL17)&nbsp;รวมทั้งสิ้น&nbsp;8&nbsp;สถานี&nbsp;ซึ่งกลุ่มนักเรียนสามารถปฏิบัติตามได้เป็นอย่างดี</span>
                                                </div>
                                            </span>
                                            <div style={{ textAlign: 'justify' }}>&nbsp;</div>
                                            <div style={{ textAlign: 'center' }}>
                                                <span style={{ letterSpacing: '-0.015em' }}>---------------------------------------------</span>
                                            </div>
                                            &nbsp;
                                            <br />
                                            &nbsp;
                                            <br />
                                            &nbsp;
                                            <br />
                                            &nbsp;
                                            <br />
                                            <b>&nbsp;<br /></b>
                                            <b><span>ฝ่ายสื่อสารองค์กร<br /></span></b>
                                            <b><span>บริษัท อีสเทิร์น บางกอกโมโนเรล จำกัด&nbsp;</span>:<br /></b>
                                            <b><span>คุณชุติมา&nbsp; มาตศรี&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; โทร. 084-809-9998<br /></span></b>
                                            <b><span>คุณสุกัญญา&nbsp; อังประทีป &nbsp;&nbsp;&nbsp;&nbsp; โทร.&nbsp;</span>081</b>
                                            <span>-984-7112</span>
                                            <br />
                                            &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
                                            &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
                                            &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;
                                            &nbsp; &nbsp;
                                            <p><br /></p>
                                        </div>

                                    ) : selectedNews.id === 1 ? (
                                        <div className="div-details">
                                            <p style={{ textIndent: '36pt' }}>บริษัท อีสเทิร์น บางกอกโมโนเรล จำกัด (EBM) ผู้ให้บริการรถไฟฟ้ามหานคร สายสีเหลือง
                                                ช่วงลาดพร้าว-สำโรง เปิดเผยถึง การปรับแผนเดินรถไฟฟ้า จากกรณีชิ้นส่วนอุปกรณ์ ตัวจ่ายไฟถูกกระแทกว่า หลังเกิดเหตุทุกหน่วยงาน
                                                ทั้งตัวแทนจากกระทรวงคมนาคม, กรมการขนส่งทางราง, การรถไฟฟ้าขนส่งมวลชนแห่งประเทศไทย และ EBM ได้ประชุมร่วมกัน เพื่อตรวจสอบหาสาเหตุ
                                                และแนวทางการป้องกัน โดยได้หยุดให้บริการในวันที่ 28 มีนาคม 2567 ภายหลังจากเกิดเหตุการณ์ และจากการตรวจสอบเบื้องต้นพบว่า แผ่นเหล็ก
                                                (Finger Plate) ที่ติดตั้งอยู่บริเวณรอยต่อของทางวิ่ง (Expansion Joint) ได้มีการเลื่อนออกจากตำแหน่ง เมื่อขบวนรถเคลื่อนที่ผ่าน
                                                ทำให้แผ่นเหล็กดังกล่าวเคลื่อนตัวไปกระแทกรางจ่ายกระแสไฟฟ้าหลุดออกจากตำแหน่ง&nbsp;
                                                <span style={{ textIndent: '36pt' }}>ระหว่างสถานีกลันตัน (YL12) – สถานีศรีอุดม (YL16)
                                                    ทั้งนี้ภายหลังจากการหยุดให้บริการได้ทำการตรวจสอบการจับยึด และตำแหน่งของแผ่นเหล็กดังกล่าวตลอดเส้นทางรถไฟฟ้ามหานคร สายสีเหลือง
                                                    เพื่อให้เกิดความมั่นใจก่อนการเปิดให้บริการในวันถัดไป</span>
                                            </p>
                                            <br />
                                            <div style={{ textAlign: 'center' }}>
                                                <img src={News5img1} style={{ width: '100%', borderRadius: '0px' }} alt="Image 1" />
                                            </div>
                                            <br />
                                            <p style={{ textIndent: '36pt' }}>สำหรับการป้องกันในอนาคต EBM ได้ประสานงานไปยังผู้ผลิต และออกแบบอุปกรณ์จับยึดดังกล่าว เพื่อหาแนวทางแก้ไข และมาตรการป้องกันร่วมกัน&nbsp;</p>
                                            <br />
                                            <p style={{ textIndent: '36pt' }}>
                                                ทั้งนี้จากการตรวจสอบโดยละเอียด เพื่อให้เป็นไปตามมาตรฐานความปลอดภัย จึงปรับแผนการเดินรถ ตามเส้นทาง และความถี่ ตั้งแต่วันที่ 29 มีนาคม 2567 เป็นต้นไป&nbsp;
                                                <span style={{ textDecoration: 'underline' }}>พร้อมกับปรับลดอัตราค่าโดยสาร 20% ตลอดเส้นทางให้กับผู้โดยสาร จนกว่าจะกลับมาให้บริการเดินรถได้ตามปกติ</span>
                                                &nbsp;(สำหรับผู้ที่ถือบัตรแรบบิท กรุณาติดต่อเจ้าหน้าที่ห้องจำหน่ายตั๋วโดยสาร เพื่อขอรับส่วนลดค่าโดยสาร) ส่วนการปรับรูปแบบการเดินรถชั่วคราว มีดังนี้
                                                <li>สถานีลาดพร้าว (YL01) - สถานีหัวหมาก (YL11) เดินรถปกติ และมีความถี่ในการเดินรถ 10 นาที/ขบวน และช่วงเวลาเร่งด่วน 5 นาที/ขบวน</li>
                                                <li>สถานีศรีเอี่ยม (YL17) - สถานีสำโรง (YL23)&nbsp; เดินรถปกติ และความถี่ในการเดินรถ 10 นาที/ขบวน&nbsp;</li>
                                                <li>สถานีหัวหมาก (YL11) - สถานีศรีเอี่ยม (YL17) ความถี่ในการเดินรถ 25 นาที/ขบวน&nbsp;&nbsp;</li>
                                            </p>
                                            <br />
                                            <p style={{ textIndent: '36pt' }}>ทั้งนี้ผู้โดยสารที่เดินทางช่วงสถานีหัวหมาก (YL11) – สถานีศรีเอี่ยม (YL17) ต้องรอขบวนรถนานกว่าปกติ ผู้โดยสารกรุณาเผื่อเวลาในการเดินทาง และหากมีการเปลี่ยนแปลง เรื่องเส้นทางการให้บริการรถไฟฟ้ามหานคร สายสีเหลือง จะแจ้งให้ทราบอีกครั้ง&nbsp;</p>
                                            <br />
                                            <p style={{ textIndent: '36pt' }}>นอกจากนี้ทางบริษัทฯ ได้ประสานงานไปยังองค์การขนส่งมวลชนกรุงเทพ (ขสมก.) จัดรถโดยสารสาธารณะ รับ – ส่งผู้โดยสาร ตามแนวเส้นทางรถไฟฟ้ามหานคร สายสีเหลือง และทางขสมก. ได้เพิ่มจำนวนรถ ไว้ให้บริการในช่วงเช้าอีกประมาณ 10 – 15 คัน และช่วงเย็นประมาณ 10 คัน</p>
                                            <br />
                                            <p style={{ textIndent: '36pt' }}>โดยจากเหตุการณ์ดังกล่าว ทำให้ชิ้นส่วนอุปกรณ์ หลุดร่วงลงพื้นที่ถนน และมีรถยนต์ได้รับความเสียหาย ทางบริษัทฯ ได้ประสานงานกับบริษัทประกัน เพื่อดูแลผู้ได้รับผลกระทบเป็นที่เรียบร้อย&nbsp;</p>
                                            <br />
                                            <div style={{ textAlign: 'center' }}>
                                                <img src={News5img2} style={{ width: '100%', borderRadius: '0px' }} alt="Image 2" />
                                            </div>
                                            <br />
                                            <p style={{ textIndent: '36pt' }}>บริษัทฯ กราบขออภัยในความไม่สะดวกกับเหตุขัดข้องในครั้งนี้ และผู้ที่ได้รับผลกระทบสามารถ ติดต่อสอบถามรายละเอียดเพิ่มเติมได้ที่ ศูนย์ลูกค้าสัมพันธ์รถไฟฟ้ามหานคร สายสีเหลือง MRT Yellow Line&nbsp;</p>
                                            <p style={{ textIndent: '36pt' }}>Call Center โทรศัพท์ 0 2 - 617- 6111 LineOfficial : @pinkyellowline หรือ Facebook Page : YellowLineofficial</p>
                                            <div style={{ textAlign: 'center', tabStops: 'right 0cm' }}>
                                                <b>_______________________</b>
                                            </div>
                                            <p style={{ textAlign: 'justify', textIndent: '36pt' }}>
                                                <b>ฝ่ายสื่อสารองค์กร</b>
                                            </p>
                                            <p style={{ textAlign: 'justify', textIndent: '36pt' }}>
                                                <b>บริษัท อีสเทิร์น บางกอกโมโนเรล จำกัด</b>
                                            </p>
                                        </div>
                                    ) : null}
                                </div>
                            </div>
                        </div>
                    </div>
                )}
            </div>
            <Footer />
        </>
    );
}

export default Detail;


